Feature: HiterNilve_Ser058

המהלך מטפל בכל התחנות המאשרות שיש להן היתר נלווה לאשר כחלק מטיפול בבקשה להיתר.
השירות שולח התראות לתחנות ושולח מידע לבעל העסק והאם נדרש לעדכן אוטומטית סטטוס של תחנה

אם בקשה להיתר היא חידוש ולהיתר יש חידוש אוטומטי, אף תחנה לא נפתחת , אז איך שרות משפיעה על בקשה???

בדיקת חוק 4 (אושר, אושר אוטומטי, לידיעה) > מפעיל שירות 029 עדכון היתר נלווה 
 (כמות ימי תקן לתחנה מאשרת בהיתר נלווה פחות כמות ימי טיפול) kamut_yamim_lsyum_tipul כל ריצת 058 מעדכנת שדה


@Test
Scenario Outline: change hiter creation date
	Given valid access token
	* default tik rishuy
	* update objects creation date '-00-00-15T00:00', 'essek'
	* run Ser028 create additional permit with parameters: <SugIter>, <SibatBakasha>, 0.0, <NumOfIters>
	When push back HiterNilve creation date by 0 to 10 days and run Ser058

Examples:
	| SugIter | SibatBakasha | NumOfIters | StatusTahana | BeTipulEssek |
	| 1       | 0            | 1          | 1            | false        |

# default tik rishuy with parameters for mahut: <NumOfMahuyot>, <Maslul>, <MahutRashit>, <DaysBackMahut>



# <StatusBakasha>: [ris_tt_status_bakasha]  
# 1 - נשלחה
# 2 - אושרה
# 3 - סיום טיפול
# 4 - בטיפול

# [ris_tt_status_tachana_measheret]
# 1	נשלח
# 2	טיפול
# 3	אישור
# 4	סירוב
# 5	תנאי מוקדם
# 8	לידיעה
# 11 היתר זמני
# 12 תזכורת
# 13 חידוש היתר
# 17 נדחה על ידי הפיקוח
# 18 אושר על ידי הפיקוח
# 19 בבדיקת גורם הפיקוח
# 20 אושרה בקשת מרכול לשבת
# 21 אושר היתר מזורז א
# 22 אושר היתר מזורז ב
# 23 אושר היתר מזורז א הארכה
# 24 אושר היתר מזורז ב הארכה
# 25 אושר אוטומטית
# 26 היתר זמני אוטומטית
# 27 אושר תצהיר
# 28 נדחה
# 98 בטיפול של בעל עסק
# 99 נדחה אוטומטית

# -- תקנים -- [ris_tt_maarechet_parameter]
# erech_parameter  Description	                              
# מספר ימים לתשלום אגרת היתר נלווה  10     
# מספר ימים להתראה לבעל עסק בהיתר נלווה  4
# מספר ימים להתראה לתחנה מאשרת בהיתר נלווה  2
# כמות ימי תקן לתחנה מאשרת בהיתר נלווה  10


# -- קשר סטטוס תחנה מאשרת לקטגוריית סטטוס תחנה --
# סטטוסים                            קטגוריה 
#
# אושר, סורב, אושר היתר מזורז א, אושר היתר מזורז ב, אושר אוטומטית, אושר תצהיר               החלטה
# אושר, סורב, אושר אוטומטית, אושר תצהיר         החלטה סופית
# אושר, לידיעה, אושר אוטומטית   חוק 4 –סיום טיפול
# אושר היתר מזורז א, אושר היתר מזורז ב, אושר אוטומטית, לידיעה               חוק 5 
# אושר, אושר אוטומטית, אושר תצהיר, היתר זמני, היתר זמני אוטומטי               חוק 8
# נשלח, בטיפול תחנה, בטיפול בעל עסק            אי טיפול

# -- קטגוריות סטטוס תחנה -- [ris_tt_kategoriat_status_tachana]
# Code	teur
# 1	    החלטה
# 2 	החלטה סופית
# 3 	חוק 4
# 4 	חוק 5
# 5     חוק 8
# 6 	ללא טיפול